export type Step = {
  number: string;
  title: string;
  description: string;
};

export type ResultItem = {
  title: string;
  description: string;
};

export type Case = {
  title: string;
  clientGoal: string;
  steps: Step[];
  resultsList: ResultItem[];
  secondResultList: ResultItem[];
  resultsTitle?: string;
  images?: string[];
};

export const caseData: { [key: number]: Case } = {
  1: {
    title: "Магазин одежды",
    clientGoal:
      "Клиент обратился к нам с целью увеличить продажи через интернет. У бизнеса уже был сайт и соцсети, но конверсия оставляла желать лучшего. Основная задача — привлечь новых клиентов и увеличить прибыль за счёт рекламы в Яндекс Директ. Вот как мы справились:",
    resultsTitle: "Результаты за 4 месяца",
    steps: [
      {
        number: "01",
        title: "Изучили целевую аудиторию",
        description:
          "Мы детально проанализировали интересы и поведение потенциальных покупательниц: женщин 25–45 лет, увлечённых модой. Это позволило нам определить ключевые запросы, которые они используют для поиска одежды.",
      },
      {
        number: "02",
        title: "Оптимизировали рекламные кампании",
        description:
          "На основе собранных данных мы разработали новые стратегии для рекламных кампаний. Каждое объявление и ключевое слово были продуманы, чтобы точно соответствовать интересам аудитории.",
      },
      {
        number: "03",
        title: "Постоянно следили за результатами",
        description:
          "Мы отслеживали такие метрики, как количество кликов, конверсии и стоимость клика. Кампании регулярно корректировались, чтобы сделать их ещё эффективнее.",
      },
      {
        number: "04",
        title: "Улучшили стратегию",
        description:
          "После первого месяца мы расширили список ключевых запросов, добавили новые таргетинги и перераспределили бюджет между наиболее эффективными кампаниями. Это позволило продолжить рост.",
      },
    ],
    resultsList: [
      {
        title: "+30%",
        description:
          "Рост прибыли на 30%. <br/>Магазин получил значительную дополнительную прибыль за счёт увеличения онлайн-продаж.",
      },
      {
        title: "53 000 000 РУБ.",
        description:
          "Выручка — 53 миллиона рублей. При бюджете 10 миллионов на рекламу ДРР составил всего 19%.",
      },
    ],
    secondResultList: [
      {
        title: "+55%",
        description:
          "Увеличение трафика и конверсий. Количество кликов выросло на 90%, а конверсия — на 55%.",
      },
      {
        title: "+120%",
        description:
          "Рост узнаваемости бренда. Интерес к бренду увеличился на 120%. Лучшие позиции сайта. Благодаря грамотной оптимизации реклама помогла сайту занять 1 место по брендовым запросам.",
      },
    ],
  },
  2: {
    title: "Магазин товаров для дома и ремонта",
    clientGoal:
      "Клиент — магазин товаров для дома и ремонта — обратился к нам с проблемой: высокая стоимость лида и нерентабельные инвестиции в рекламу. Из-за высокой конкуренции с лидерами рынка интернет-продажи оставались на низком уровне. Главная цель: увеличить продажи в ограниченном регионе и повысить узнаваемость бренда.",
    resultsTitle: "Результаты за 10 месяцев",
    steps: [
      {
        number: "01",
        title: "Оптимизировали сайт",
        description:
          "Начали с технического аудита, который выявил проблемы с индексацией страниц и недостатки в контенте. Исправили всё, чтобы сайт лучше работал в поисковых системах.",
      },
      {
        number: "02",
        title: "Создали рекламные кампании в Яндекс Директ",
        description:
          "Мы разработали кампании, ориентированные на аудиторию, занимающуюся ремонтом и обустройством дома. Добавили ремаркетинг, чтобы возвращать посетителей, и сделали упор на уникальность локального бренда, что выгодно выделило магазин на фоне крупных сетей.",
      },
      {
        number: "03",
        title: "Постоянно анализировали результаты",
        description:
          "Отслеживали метрики: клики, конверсии, CTR, стоимость клика. Благодаря регулярным корректировкам, результаты кампаний становились всё лучше.",
      },
      {
        number: "04",
        title: "Провели промежуточный анализ",
        description:
          "Через 3 месяца мы увидели значительные улучшения: клики выросли на 70%, конверсия — на 50%, а стоимость клика снизилась на 25%.",
      },
      {
        number: "05",
        title: "Улучшили стратегию",
        description:
          "Мы расширили список ключевых запросов и добавили новые вводные в стратегию. Кампании стали ещё более эффективными.",
      },
      {
        number: "06",
        title: "Повторно оценили результаты",
        description:
          "Через 6 месяцев клики увеличились ещё на 30%, а конверсия выросла на 15%.",
      },
    ],
    resultsList: [
      {
        title: "+50%",
        description:
          "Магазин заработал на 50% больше, благодаря новым клиентам и повышению повторных покупок.",
      },
      {
        title: "Рост узнаваемости бренда.",
        description:
          "Органический трафик вырос за счёт эффективного продвижения.",
      },
    ],
    secondResultList: [
      {
        title: "Высокая окупаемость",
        description:
          "Реклама окупилась в несколько раз, а продажи в офлайн-точках значительно выросли.",
      },
    ],
  },
  3: {
    title: "Интернет-магазин косметики",
    clientGoal:
      "Клиент — онлайн-магазин косметики, существующий 2 года, но не имеющий сформированной аудитории, обратился с целью увеличить прибыль через расширение клиентской базы и рост узнаваемости бренда.",
    steps: [
      {
        number: "01",
        title: "Проанализировали аудиторию",
        description:
          "Детально изучили предпочтения, поведение и способы коммуникации целевой аудитории. Это позволило понять, как привлечь женщин, заинтересованных в качественной косметике.",
      },
      {
        number: "02",
        title: "Изучили конкурентов",
        description:
          "Мы разобрали ключевых игроков рынка и нашли преимущество клиента в его уникальной товарной матрице.",
      },
      {
        number: "03",
        title: "Разработали кампании в Яндекс Директ",
        description:
          "Создали акцент на популярные продукты и акции, чтобы привлечь внимание целевой аудитории.",
      },
      {
        number: "04",
        title: "Запустили мобильное приложение",
        description:
          "Основной трафик был направлен на приложение, что повысило удобство покупок и удержание клиентов.",
      },
      {
        number: "05",
        title: "Регулярно отслеживали результаты",
        description:
          "Анализировали клики, конверсии, CTR, стоимость клика, а также данные о продажах. Благодаря постоянному мониторингу выявлялись самые эффективные стратегии, которые мы масштабировали.",
      },
    ],
    resultsList: [
      {
        title: "+70%",
        description:
          "Привлечение новых клиентов и повышение конверсии увеличили продажи магазина.",
      },
      {
        title: "56 ₽ рублей",
        description: "При бюджете 9 ₽ рублей ДРР составил всего 16%.",
      },
    ],
    secondResultList: [
      {
        title: "+170%",
        description: "Число брендовых запросов увеличилось на 170%.",
      },
    ],
  },
  4: {
    title: "Юридические услуги",
    clientGoal:
      "Клиент — юридическая фирма, специализирующаяся на банкротстве физических лиц, решил запустить онлайн-консультирование. Ранее услуги оказывались только офлайн. Главные задачи: увеличить прибыль, расширить географию и снизить расходы на рекламу.",
    resultsTitle: "Результаты за 12 месяцев",
    steps: [
      {
        number: "01",
        title: "Проанализировали аудиторию",
        description:
          "Провели глубокое изучение целевой аудитории: возраст, интересы и потребности. Определили ключевые сегменты, на которые сделали основной акцент.",
      },
      {
        number: "02",
        title: "Изучили конкурентов",
        description:
          "Выявили, что акцент на безопасность и доверие станет главным преимуществом клиента.",
      },
      {
        number: "03",
        title: "Запустили рекламные кампании",
        description:
          "Создали кампании в Яндекс Директ с упором на ключевые и высокомаржинальные услуги. Настроили ремаркетинг для возвращения потенциальных клиентов.",
      },
      {
        number: "04",
        title: "Построили воронку продаж",
        description:
          "Разработали структурированную стратегию, которая вела клиента от первого знакомства до покупки услуги.",
      },
      {
        number: "05",
        title: "Постоянно отслеживали результаты",
        description:
          "Регулярный мониторинг метрик позволял быстро реагировать на изменения и внедрять улучшения.",
      },
    ],
    resultsList: [
      {
        title: "+130%",
        description:
          "Расширение географии и привлечение новой аудитории помогли увеличить выручку до 120 ₽ рублей.",
      },
      {
        title: "Рост узнаваемости бренда",
        description:
          "Увеличение количества заявок на высокомаржинальные услуги.",
      },
    ],
    secondResultList: [
      {
        title: "Повышение лояльности",
        description:
          "Показатель LTV вырос благодаря доверию и качественному обслуживанию.",
      },
    ],
  },
  5: {
    title: "Медицина",
    clientGoal:
      "Клиника с уникальными услугами и высококвалифицированными врачами имела одну проблему — загрузка была полной только осенью. Задача: равномерно распределить загрузку, повысить узнаваемость бренда и оптимизировать рекламные расходы.",
    resultsTitle: "Результаты за 10 месяцев",
    steps: [
      {
        number: "01",
        title: "Проанализировали аудиторию",
        description:
          "Выявили ключевые сегменты и их потребности: возраст, интересы и каналы коммуникации.",
      },
      {
        number: "02",
        title: "Настроили рекламные кампании",
        description:
          "Создали кампании в Яндекс Директ с акцентом на уникальные услуги клиники и сезонные акции.",
      },
      {
        number: "03",
        title: "Запустили таргетированную рекламу",
        description:
          "Настроили точечные кампании в соцсетях и Яндекс Директ для охвата целевой аудитории.",
      },
      {
        number: "04",
        title: "Постоянно анализировали результаты",
        description:
          "Контролировали клики, конверсии и стоимость рекламы, чтобы своевременно оптимизировать кампании.",
      },
    ],
    resultsList: [
      {
        title: "+40%",
        description:
          "Привлечение новых клиентов и равномерная загрузка увеличили доход клиники.",
      },
      {
        title: "Повышение узнаваемости.",
        description:
          "Клиенты стали чаще возвращаться, а число новых записей выросло.",
      },
    ],
    secondResultList: [
      {
        title: "Стабильная загрузка",
        description: "Впервые клиника достигла 70% загрузки в течение года.",
      },
    ],
  },
  6: {
    title: "Аренда спецтехники",
    clientGoal:
      "Клиент — компания по аренде спецтехники, работающая в Москве и Санкт-Петербурге более 5 лет. Основной источник лидов — контекстная реклама в Яндекс Директ. Однако за последние 3 года стоимость лида выросла, что негативно сказалось на прибыльности бизнеса. Наша задача: снизить стоимость лида и увеличить рентабельность за счёт работы с SEO.",
    resultsTitle: "Результаты за 10 месяцев",
    images: ["/img/арендаспецтехники.webp"],
    steps: [
      {
        number: "01",
        title: "Провели аудит сайта",
        description:
          "На первом этапе мы выявили ключевые проблемы:<br/>•\tнеполная индексация страниц.<br/>•\tошибки в структуре сайта.<br/>•\tотсутствие оптимизированных метатегов и заголовков.<br/>•\tнизкая скорость загрузки страниц.",
      },
      {
        number: "02",
        title: "Оптимизировали сайт",
        description:
          "•\tисправили технические ошибки: настроили индексацию, обновили структуру URL.<br/>•\tдобавили и переработали метатеги для страниц услуг.<br/>•\tсоздали контент, который отвечает на ключевые запросы клиентов.<br/>•\tповысили скорость загрузки сайта, особенно для мобильных пользователей.",
      },
      {
        number: "03",
        title: "Расширили семантическое ядро",
        description:
          "Мы детально проанализировали ключевые запросы и добавили семантику, связанную с новыми видами спецтехники и услуг. Это позволило привлечь больше целевой аудитории и повысить видимость сайта в поиске.",
      },
      {
        number: "04",
        title: "Работа с локальным SEO",
        description:
          "Для улучшения видимости в регионах Москва и Санкт-Петербург мы настроили локальные страницы, оптимизировали карточки компании в Яндекс Картах и добавили отзывы клиентов.",
      },
      {
        number: "05",
        title: "Постоянный мониторинг и корректировка.",
        description:
          "На протяжении года регулярно отслеживались ключевые метрики: позиции сайта, органический трафик, конверсия. Вносились корректировки, чтобы удерживать рост.",
      },
    ],
    resultsList: [
      {
        title: "Снижение цены лида в 2,4 раза.",
        description:
          "Благодаря стабильному потоку органического трафика затраты на привлечение клиентов значительно сократились.",
      },
      {
        title: "ТОП-3 в поисковой выдаче.",
        description:
          "Сайт компании занял лидирующие позиции по основным коммерческим запросам.",
      },
    ],
    secondResultList: [
      {
        title: "Рост органического трафика на 85%.",
        description:
          "Пользователи стали находить сайт через поиск, что привело к увеличению числа заявок.",
      },
      {
        title: "Увеличение конверсии<br/>сайта на 30%.",
        description:
          "Доработки структуры и контента привели<br/> к росту числа заявок от посетителей сайта.",
      },
    ],
  },
  7: {
    title: "Интернет-магазин",
    clientGoal:
      "Клиент — федеральный интернет-магазин климатической техники Аэрос, лидер рынка по объёму продаж бризеров и рекуператоров в России. Основными каналами привлечения клиентов были Яндекс Директ, SEO и прямые продажи.С ростом популярности маркетплейсов (Ozon, Wildberries) компания столкнулась с серьёзной проблемой: маркетплейсы начали вытеснять Аэрос из ТОП-3 поисковой выдачи. В результате органический трафик снизился, а позиции сайта упали до 5–15 мест в зависимости от запроса. Наша задача: вернуть позиции в ТОП-3, восстановить органический трафик и увеличить количество лидов из SEO.",
    resultsTitle: "Результаты за 10 месяцев",
    images: [
      "/img/АЭРОС07.021.webp",
      "/img/АЭРОС07.022.webp",
      "/img/АЭРОС07.023.webp",
      "/img/АЭРОС07.024.webp",
    ],
    steps: [
      {
        number: "01",
        title: "Провели комплексный аудит сайта",
        description:
          "•\tпроанализировали текущие позиции и выявили основные точки падения трафика.<br/>•\tОпределили запросы, где сайт конкурирует с маркетплейсами, и скорректировали стратегию.<br/>•\tВыявили технические ошибки, мешающие индексации и ранжированию.",
      },
      {
        number: "02",
        title: "Расширили ассортимент и оптимизировали структуру сайта",
        description:
          "По нашей рекомендации ассортимент был увеличен с 700 до 5000 SKU. Это позволило охватить новые запросы, повысить релевантность сайта и привлечь больше целевой аудитории.<br/>•\tсоздали отдельные категории для новых товаров.<br/>•\tоптимизировали фильтры и навигацию, что улучшило пользовательский опыт и конверсию.<br/>•\tдобавили страницы для низкочастотных запросов, связанных с уникальными товарами.",
      },
      {
        number: "03",
        title: "Переработали контент и метатеги",
        description:
          "•\tобновили карточки товаров, добавив уникальные описания, ключевые слова и полезные инструкции.<br/>•\tСоздали новые тексты для категорий и посадочных страниц, ориентированные на коммерческие запросы.<br/>•\tУлучшили метатеги, чтобы повысить кликабельность (CTR) страниц.",
      },
      {
        number: "04",
        title: "Настроили локальное SEO",
        description:
          "Для укрепления позиций в регионах мы:<br/>•\tоптимизировали карточки компании в Яндекс Картах и Google My Business.<br/>•\tдобавили локальные ключевые запросы на страницы.",
      },
      {
        number: "05",
        title: "Постоянный мониторинг и корректировка",
        description:
          "•\tЕженедельно отслеживали позиции по ключевым запросам и поведение конкурентов.<br/>•\tВносили изменения в стратегию, чтобы оперативно реагировать на действия маркетплейсов.<br/>•\tРазработали отдельные стратегии продвижения для Яндекса и Google, учитывая их алгоритмы.",
      },
    ],
    resultsList: [
      {
        title: "Возвращение в ТОП-3",
        description:
          "Сайт компании обошёл маркетплейсы по ключевым запросам, связанным с бризерами и рекуператорами.",
      },
      {
        title: "Рост органического трафика на 120%",
        description: "Увеличение количества визитов с поисковых систем.",
      },
    ],
    secondResultList: [
      {
        title: "Увеличение числа лидов на 80%",
        description: "SEO стало одним из основных источников заявок.",
      },
      {
        title: "Снижение зависимости от маркетплейсов.",
        description:
          "Расширение ассортимента и грамотное продвижение вернули клиенту контроль над продажами через собственный сайт.",
      },
    ],
  },
  8: {
    title: "Музыкальные школы",
    clientGoal:
      "Клиент — сеть музыкальных школ, работающая в четырёх крупных городах: Новосибирске, Красноярске, Екатеринбурге и Краснодаре. SEO-трафик всегда был основным источником лидов, благодаря чему бизнес экономил маркетинговый бюджет и сохранял высокую рентабельность. Однако из-за роста конкуренции позиции сайта вышли из ТОП-3 в Яндексе и Google, что привело к снижению органического трафика и падению числа заявок. Старый подрядчик SEO не смог справиться с ситуацией, и клиент обратился к нам за помощью. Наша задача: Вернуть позиции в ТОП-3 в каждом из городов, восстановить органический трафик и увеличить поток заявок через SEO.",
    resultsTitle: "Результаты за 6 месяцев",
    images: ["/img/школа1.webp", "/img/школа2.webp"],
    steps: [
      {
        number: "01",
        title: "Провели аудит сайта и конкурентов",
        description:
          "•\tвыявили технические ошибки, мешающие индексации и ранжированию.<br/>•\tПроанализировали сайты конкурентов, изучили их сильные стороны и стратегию продвижения.<br/>•\tОпределили ключевые запросы, которые обеспечивают трафик в каждом из городов.",
      },
      {
        number: "02",
        title: "Оптимизировали структуру сайта",
        description:
          "•\tСоздали отдельные страницы для каждого города, что позволило таргетироваться на локальные запросы.<br/>•\tДобавили новые категории и разделы, которые отражают популярные услуги и запросы.<br/>•\tУлучшили навигацию, сделав сайт удобным для пользователей и поисковых систем.",
      },
      {
        number: "03",
        title: "Переработали контент",
        description:
          "•\tНаписали уникальные тексты для городских страниц с использованием локальных ключевых слов.<br/>•\tОбновили информацию о программах обучения, добавив детали, которые помогают конвертировать посетителей в заявки.<br/>•\tСоздали раздел с отзывами и кейсами учеников для повышения доверия.",
      },
      {
        number: "04",
        title: "Оптимизировали техническую часть",
        description:
          "•\tУскорили загрузку сайта, чтобы соответствовать требованиям поисковых систем.<br/>•\tНастроили микроразметку, чтобы улучшить отображение в поисковой выдаче.<br/>•\tИсправили ошибки, влияющие на индексацию, такие как дубли страниц и битые ссылки.",
      },
      {
        number: "05",
        title: "Разработали отдельные стратегии для Яндекса и Google",
        description:
          "•\tВ Яндексе сделали акцент на локальное SEO, включив карточки организаций и размещение на Яндекс Картах.<br/>•\tВ Google усилили работу с контентом и ссылочной массой, увеличив количество внешних ссылок с авторитетных сайтов.",
      },
      {
        number: "06",
        title: "Еженедельный мониторинг и корректировка",
        description:
          "•\tРегулярно отслеживали позиции, трафик и конкурентов.<br/>•\tВносили изменения в стратегии продвижения на основе аналитики и поведения пользователей.",
      },
    ],
    resultsList: [
      {
        title: "Возвращение в ТОП-3.",
        description:
          "Сайт занял первые три позиции по ключевым запросам в каждом городе.",
      },
      {
        title: "Рост органического трафика на 140%.",
        description: "Восстановлен основной источник заявок.",
      },
    ],
    secondResultList: [
      {
        title: "Увеличение количества лидов на 90%",
        description: "SEO вновь стало ключевым драйвером роста бизнеса.",
      },
      {
        title: "Снижение стоимости<br/> лида на 35%",
        description:
          " Экономия маркетингового бюджета<br/> позволила инвестировать<br/> в развитие школ.",
      },
    ],
  },
};
